# Titanic Dataset

In [28]:
import pandas as pd
import numpy as np
import seaborn as sns

In [29]:
data = pd.read_csv('Titanic_Dataset.csv')

In [30]:
data.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [31]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [33]:
data.shape

# Totol 891 rows and 12 columns

(891, 12)

In [34]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Finding The Missing Values

In [35]:

data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [36]:
# We can see Age and Cabin Column having the  null values
''' we can replace the age by using the Median'''

' we can replace the age by using the Median'

In [37]:
pr =((data['Age'].isnull().sum())/len(data['Age']))*100
print(pr)
# we have 19.89 % Missing values

19.865319865319865

In [38]:
data['Age'].fillna(data['Age'].median(),inplace=True)

C:\Users\akash\AppData\Local\Temp\ipykernel_18784\2124576783.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].median(),inplace=True)

In [39]:
data['Age'].isnull().sum()

0

In [40]:
# Now Cabin
# Lets first check the data type of Cabin
data['Cabin'].info()
# data type is object , then its can be filled by the Mode

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Cabin
Non-Null Count  Dtype
--------------  -----
204 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [41]:
# lets check the percentage of the missing value

pr1= ((data['Cabin'].isnull().sum())/len(data['Cabin']))*100
print(pr1)

# we have 77.10% Missing value then , we can not fill it. It can be bias.

77.10437710437711

In [42]:
#l we droping the Cabin Column from the data
data.drop(columns='Cabin',inplace=True)

In [43]:
# Embarked
data['Embarked'].isnull().sum()
# its little vaue

2

In [16]:
# check the data type and info
data['Embarked'].info()

''' Data type is objective .we can fil it by its mode
'''

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Embarked
Non-Null Count  Dtype
--------------  -----
889 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

' Data type is objective .we can fil it by its mode\n'

In [17]:
data['Embarked'].fillna(data['Embarked'].mode()[0],inplace=True)

C:\Users\akash\AppData\Local\Temp\ipykernel_18784\1523684883.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Embarked'].fillna(data['Embarked'].mode()[0],inplace=True)

In [18]:
data['Embarked'].isnull().sum()

0

In [44]:
data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

# Label Encoding
* Label Encoding is used for convert the Categorical data into Numerical data or formate.

In [45]:
# define function for encoding

def encode(df):
    for col in (df.select_dtypes(include=['object']).columns) :  
        df[col], _ = pd.factorize(df[col])  
    return df  
# it will work at once for all data type

In [46]:
# create list of which column having the Object data type
obj_t = data.select_dtypes(include=['object']).columns.tolist()

print(obj_t)

['Name', 'Sex', 'Ticket', 'Embarked']

In [47]:
# now we apply encoding on actual dataframe
encoded_data = encode(data)

In [48]:
print(encoded_data.head())

   PassengerId  Survived  Pclass  Name  Sex   Age  SibSp  Parch  Ticket  \
0            1         0       3     0    0  22.0      1      0       0
1            2         1       1     1    1  38.0      1      0       1
2            3         1       3     2    1  26.0      0      0       2
3            4         1       1     3    1  35.0      1      0       3
4            5         0       3     4    0  35.0      0      0       4

      Fare  Embarked
0   7.2500         0
1  71.2833         1
2   7.9250         0
3  53.1000         0
4   8.0500         0

In [49]:
encoded_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,0,0,22.0,1,0,0,7.2500,0
1,2,1,1,1,1,38.0,1,0,1,71.2833,1
2,3,1,3,2,1,26.0,0,0,2,7.9250,0
3,4,1,1,3,1,35.0,1,0,3,53.1000,0
4,5,0,3,4,0,35.0,0,0,4,8.0500,0
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,886,0,27.0,0,0,677,13.0000,0
887,888,1,1,887,1,19.0,0,0,678,30.0000,0
888,889,0,3,888,1,28.0,1,2,614,23.4500,0
889,890,1,1,889,0,26.0,0,0,679,30.0000,1
890,891,0,3,890,0,32.0,0,0,680,7.7500,2